
. cap mkdir ./output/time_series

. * Time series analysis CVD outcomes
. * Clinical monitoring: BP measurement
. /* Hospital admissions: any code and primary code for MI, stroke, heart failu
> re and vte
> local a "bp_meas_cvd mi_primary_admission stroke_primary_admission heart_fail
> ure_primary_admission vte_primary_admission"
> local z "bp_cvd mi_pri stroke_pri hf_pri vte_pri"
> forvalues i=1/5 {
>     local c: word `i' of `a' 
>     local e: word `i' of `z'
>         local b "ethnicity"
>         forvalues i=1/1 {
>         local d: word `i' of `b'
>                 import delimited "./output/measures/cvd/measure_`c'_`d'_rate.
> csv", numericcols(4) clear //get csv
>         putexcel set ./output/time_series/tsreg_tables_cvd, sheet(`e'_`d') mo
> dify                       //open xlsx
>         * Drop records where ethnicity is missing - no missing IMD
>         drop if `d'==0
>         *Format time
>         gen temp_date=date(date, "YMD")
>         format temp_date %td
>         gen postcovid=(temp_date>=date("23/03/2020", "DMY"))
>         gen month=mofd(temp_date)
>         format month %tm
>         *Define Seasons
>         gen season=4
>         replace season = 1 if inrange(month(temp_date),3,5)
>         replace season = 2 if inrange(month(temp_date),6,8)
>         replace season = 3 if inrange(month(temp_date),9,11)
>         label define seasonlab 1 "Spring" 2 "Summer" 3 "Autumn" 4 "Winter"
>         label values season seasonlab
>         drop temp_date
>         *Value to rate per 100k
>         gen rate = value*100000
>         *Run time series with EWH-robust SE and 1 Lag
>         tsset `d' month
>         newey rate i.`d'##i.postcovid i.season, lag(1) force
>         *Export results
>         putexcel E1=("Number of obs") G1=(e(N))
>         putexcel E2=("F") G2=(e(F))
>         putexcel E3=("Prob > F") G3=(Ftail(e(df_m), e(df_r), e(F)))
>         matrix a = r(table)'
>         putexcel A6 = matrix(a), rownames
>         putexcel save
>         quietly margins `d'##postcovid
>         marginsplot
>         graph export ./output/time_series/margins_cvd_`e'_`d'.svg, as(svg) re
> place
>         import excel using ./output/time_series/tsreg_tables_cvd.xlsx, sheet 
> (`e'_`d') clear
>         export delimited using ./output/time_series/tsreg_cvd_`e'_`d'.csv, re
> place
>         }
>     }
> */
. * BP only
. import delimited "./output/measures/cvd/measure_bp_meas_cvd_ethnicity_rate.cs
> v", numericcols(4) clear   //get csv
(6 vars, 600 obs)

. putexcel set ./output/time_series/tsreg_tables_cvd, sheet(bp_meas_cvd_ethnici
> ty) modify                 //open xlsx

. * Drop records where ethnicity is missing - no missing IMD
. drop if ethnicity==0 | ethnicity==.
(100 observations deleted)

. drop if cvd_subgroup==0
(250 observations deleted)

. *Format time
. gen temp_date=date(date, "YMD")

. format temp_date %td

. gen postcovid=(temp_date>=date("23/03/2020", "DMY"))

. gen month=mofd(temp_date)

. format month %tm

. *Define Seasons
. gen season=4

. replace season = 1 if inrange(month(temp_date),3,5)
(70 real changes made)

. replace season = 2 if inrange(month(temp_date),6,8)
(60 real changes made)

. replace season = 3 if inrange(month(temp_date),9,11)
(60 real changes made)

. label define seasonlab 1 "Spring" 2 "Summer" 3 "Autumn" 4 "Winter"

. label values season seasonlab

. drop temp_date

. *Value to rate per 100k
. gen rate = value*100000
(75 missing values generated)

. *Run time series with EWH-robust SE and 1 Lag
. tsset ethnicity month
       panel variable:  ethnicity (strongly balanced)
        time variable:  month, 2018m3 to 2022m4
                delta:  1 month

. newey rate i.ethnicity##i.postcovid i.season, lag(1) force

Regression with Newey-West standard errors      Number of obs     =        175
maximum lag: 1                                  F( 12,       162) =       1.43
                                                Prob > F          =     0.1549

------------------------------------------------------------------------------
             |             Newey-West
        rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   ethnicity |
          2  |  -14417.75   11872.41    -1.21   0.226     -37862.4    9026.894
          3  |  -16506.27   10716.99    -1.54   0.125    -37669.28     4656.74
          4  |  -2587.878   14148.98    -0.18   0.855     -30528.1    25352.35
          5  |  -15361.69   12141.88    -1.27   0.208    -39338.45    8615.077
             |
 1.postcovid |  -15990.27   11976.76    -1.34   0.184    -39640.96    7660.419
             |
   ethnicity#|
   postcovid |
        2 1  |   25340.45   15806.09     1.60   0.111    -5872.096    56552.99
        3 1  |    20433.7   13770.08     1.48   0.140    -6758.299    47625.71
        4 1  |  -1095.113   16743.49    -0.07   0.948    -34158.75    31968.53
        5 1  |   21143.46   14681.69     1.44   0.152    -7848.694    50135.62
             |
      season |
     Summer  |   14208.99   6515.402     2.18   0.031     1342.922    27075.06
     Autumn  |  -2758.987   4820.947    -0.57   0.568    -12278.99    6761.014
     Winter  |   3372.421   6656.875     0.51   0.613    -9773.015    16517.86
             |
       _cons |   22802.94   10836.69     2.10   0.037     1403.567    44202.32
------------------------------------------------------------------------------

. *Export results
. putexcel E1=("Number of obs") G1=(e(N))
file ./output/time_series/tsreg_tables_cvd.xlsx saved

. putexcel E2=("F") G2=(e(F))
file ./output/time_series/tsreg_tables_cvd.xlsx saved

. putexcel E3=("Prob > F") G3=(Ftail(e(df_m), e(df_r), e(F)))
file ./output/time_series/tsreg_tables_cvd.xlsx saved

. matrix a = r(table)'

. putexcel A6 = matrix(a), rownames
file ./output/time_series/tsreg_tables_cvd.xlsx saved

. putexcel save

. quietly margins ethnicity##postcovid

. marginsplot

  Variables that uniquely identify margins: ethnicity postcovid

. graph export ./output/time_series/margins_cvd_bp_cvd_ethnicity.svg, as(svg) r
> eplace
(note: file ./output/time_series/margins_cvd_bp_cvd_ethnicity.svg not found)
(file ./output/time_series/margins_cvd_bp_cvd_ethnicity.svg written in SVG form
> at)

. import excel using ./output/time_series/tsreg_tables_cvd.xlsx, sheet (bp_meas
> _cvd_ethnicity) clear
(10 vars, 27 obs)

. export delimited using ./output/time_series/tsreg_cvd_bp_cvd_ethnicity.csv, r
> eplace
(note: file ./output/time_series/tsreg_cvd_bp_cvd_ethnicity.csv not found)
file ./output/time_series/tsreg_cvd_bp_cvd_ethnicity.csv saved

. 
end of do-file

. . file open output using "/tmp/tmp.4B1DBznq67", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


