
. cap mkdir ./output/time_series

. * Time series analysis CVD outcomes
. * Clinical monitoring: BP measurement
. * Hospital admissions: any code and primary code for MI, stroke, heart failur
> e and vte
. local a "bp_meas_cvd /*mi_admission stroke_admission heart_failure_admission 
> vte_admission mi_primary_admission stroke_primary_admission heart_failure_pri
> mary_admission vte_primary_admission*/"

. local z "bp_cvd /*mi_admit stroke_admit hf_admit vte_admit mi_pri stroke_pri 
> hf_pri vte_pri*/"

. forvalues i=1/1 {
  2.     local c: word `i' of `a' 
  3.     local e: word `i' of `z'
  4.         local b "ethnicity imd"
  5.         forvalues i=1/2 {
  6.         local d: word `i' of `b'
  7.                 import delimited "./output/measures/cvd/measure_`c'_`d'_ra
> te.csv", numericcols(4) clear //get csv
  8.         putexcel set ./output/time_series/tsreg_tables_cvd, sheet(`e'_`d')
>  modify                       //open xlsx
  9.         * Drop records where ethnicity is missing - no missing IMD
.         drop if `d'==0
 10.         *Format time
.         gen temp_date=date(date, "YMD")
 11.         format temp_date %td
 12.         gen postcovid=(temp_date>=date("23/03/2020", "DMY"))
 13.         gen month=mofd(temp_date)
 14.         format month %tm
 15.         *Define Seasons
.         gen season=4
 16.         replace season = 1 if inrange(month(temp_date),3,5)
 17.         replace season = 2 if inrange(month(temp_date),6,8)
 18.         replace season = 3 if inrange(month(temp_date),9,11)
 19.         label define seasonlab 1 "Spring" 2 "Summer" 3 "Autumn" 4 "Winter"
 20.         label values season seasonlab
 21.         drop temp_date
 22.         *Value to rate per 100k
.         gen rate = value*100000
 23.         *Run time series with EWH-robust SE and 1 Lag
.         tsset `d' month
 24.         newey rate i.`d'##i.postcovid i.season, lag(1) force
 25.         *Export results
.         putexcel E1=("Number of obs") G1=(e(N))
 26.         putexcel E2=("F") G2=(e(F))
 27.         putexcel E3=("Prob > F") G3=(Ftail(e(df_m), e(df_r), e(F)))
 28.         matrix a = r(table)'
 29.         putexcel A6 = matrix(a), rownames
 30.         putexcel save
 31.         quietly margins `d'##postcovid
 32.         marginsplot
 33.         graph export ./output/time_series/margins_cvd_`e'_`d'.svg, as(svg)
>  replace
 34.         import excel using ./output/time_series/tsreg_tables_cvd.xlsx, she
> et (`e'_`d') clear
 35.         export delimited using ./output/time_series/tsreg_cvd_`e'_`d'.csv,
>  replace
 36.         }
 37.     }
(5 vars, 300 obs)
(0 observations deleted)
(84 real changes made)
(72 real changes made)
(72 real changes made)
(89 missing values generated)
       panel variable:  ethnicity (weakly balanced)
        time variable:  month, 2018m3 to 2022m4
                delta:  1 month

Regression with Newey-West standard errors      Number of obs     =        161
maximum lag: 1                                  F( 12,       148) =       1.27
                                                Prob > F          =     0.2446

------------------------------------------------------------------------------
             |             Newey-West
        rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   ethnicity |
          2  |  -24088.76   49845.08    -0.48   0.630    -122588.7    74411.22
          3  |   -18581.6   43986.36    -0.42   0.673      -105504    68340.84
          4  |  -55593.68   36841.09    -1.51   0.133    -128396.2    17208.82
          5  |  -19984.34   44830.68    -0.45   0.656    -108575.3    68606.58
             |
 1.postcovid |   3229.364   46319.45     0.07   0.945    -88303.54    94762.26
             |
   ethnicity#|
   postcovid |
        2 1  |   204.8693   68586.23     0.00   0.998    -135329.9    135739.7
        3 1  |  -51055.03   66624.02    -0.77   0.445    -182712.3     80602.2
        4 1  |   41921.91   64577.58     0.65   0.517    -85691.29    169535.1
        5 1  |  -2826.761   63464.38    -0.04   0.965    -128240.1    122586.6
             |
      season |
     Summer  |    63583.9   28078.36     2.26   0.025     8097.626    119070.2
     Autumn  |   18362.52   29116.36     0.63   0.529    -39174.97    75900.01
     Winter  |   25497.98   28461.48     0.90   0.372    -30745.39    81741.35
             |
       _cons |   156664.9   36691.69     4.27   0.000     84157.62    229172.2
------------------------------------------------------------------------------
file ./output/time_series/tsreg_tables_cvd.xlsx saved
file ./output/time_series/tsreg_tables_cvd.xlsx saved
file ./output/time_series/tsreg_tables_cvd.xlsx saved
file ./output/time_series/tsreg_tables_cvd.xlsx saved

  Variables that uniquely identify margins: ethnicity postcovid
(note: file ./output/time_series/margins_cvd_bp_cvd_ethnicity.svg not found)
(file ./output/time_series/margins_cvd_bp_cvd_ethnicity.svg written in SVG form
> at)
(10 vars, 27 obs)
(note: file ./output/time_series/tsreg_cvd_bp_cvd_ethnicity.csv not found)
file ./output/time_series/tsreg_cvd_bp_cvd_ethnicity.csv saved
(5 vars, 350 obs)
(50 observations deleted)
(84 real changes made)
(72 real changes made)
(72 real changes made)
(94 missing values generated)
       panel variable:  imd (weakly balanced)
        time variable:  month, 2018m3 to 2022m4
                delta:  1 month

Regression with Newey-West standard errors      Number of obs     =        156
maximum lag: 1                                  F( 12,       143) =       0.95
                                                Prob > F          =     0.4977

------------------------------------------------------------------------------
             |             Newey-West
        rate |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         imd |
          2  |  -29974.05   34777.59    -0.86   0.390    -98718.65    38770.55
          3  |  -41605.16   32248.76    -1.29   0.199      -105351    22140.72
          4  |   19452.52   28562.89     0.68   0.497    -37007.52    75912.56
          5  |   37301.77   46324.15     0.81   0.422    -54266.81    128870.4
             |
 1.postcovid |   69861.25   55590.61     1.26   0.211    -40024.28    179746.8
             |
         imd#|
   postcovid |
        2 1  |  -31408.49   67648.51    -0.46   0.643    -165128.8    102311.8
        3 1  |  -27075.26   69631.14    -0.39   0.698    -164714.6    110564.1
        4 1  |  -58011.31   71108.02    -0.82   0.416      -198570    82547.37
        5 1  |  -108655.7   75561.88    -1.44   0.153    -258018.3    40706.84
             |
      season |
     Summer  |   45580.08   31507.48     1.45   0.150    -16700.51    107860.7
     Autumn  |  -8516.297   22793.66    -0.37   0.709    -53572.34    36539.74
     Winter  |    37435.4   29934.69     1.25   0.213    -21736.27    96607.06
             |
       _cons |   128701.5   27142.89     4.74   0.000     75048.32    182354.6
------------------------------------------------------------------------------
file ./output/time_series/tsreg_tables_cvd.xlsx saved
file ./output/time_series/tsreg_tables_cvd.xlsx saved
file ./output/time_series/tsreg_tables_cvd.xlsx saved
file ./output/time_series/tsreg_tables_cvd.xlsx saved

  Variables that uniquely identify margins: imd postcovid
(note: file ./output/time_series/margins_cvd_bp_cvd_imd.svg not found)
(file ./output/time_series/margins_cvd_bp_cvd_imd.svg written in SVG format)
(10 vars, 27 obs)
(note: file ./output/time_series/tsreg_cvd_bp_cvd_imd.csv not found)
file ./output/time_series/tsreg_cvd_bp_cvd_imd.csv saved

. 
end of do-file

. . file open output using "/tmp/tmp.msxDiLPJah", write text replace

. . file write output "success" 

. . file close output

. 
end of do-file


